In this notebook, you'll see how to connect to a Postgres database using the sqlalchemy library.

For this notebook, you'll need both the `sqlalchemy` and `psycopg2` libraries installed.

In [2]:
#!pip install psycopg2-binary

In [3]:
#!pip install psycopg2

In [4]:
from sqlalchemy import create_engine, text

First, we need to create a connection string. The format is

 ```<dialect(+driver)>://<username>:<password>@<hostname>:<port>/<database>```

To connect to the Lahman baseball database, you can use the following connection string.

In [36]:
database_name = 'Prescribers'    # Fill this in with your prescribers database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

Now, we need to create an engine and use it to connect.

In [38]:
engine = create_engine(connection_string)

sqlalchemy works well with pandas to convert query results into dataframes.

In [40]:
import pandas as pd

First, let's write a meaningful query.

In [42]:
query = 'SELECT * FROM prescriber'

Now, bring it all together using the following syntax.

In [44]:
with engine.connect() as connection:
    people = pd.read_sql(text(query), con = connection)

people.head()

,npi,nppes_provider_last_org_name,nppes_provider_first_name,nppes_provider_mi,nppes_credentials,nppes_provider_gender,nppes_entity_code,nppes_provider_street1,nppes_provider_street2,nppes_provider_city,nppes_provider_zip5,nppes_provider_zip4,nppes_provider_state,nppes_provider_country,specialty_description,description_flag,medicare_prvdr_enroll_status
0,1.003000e+09,BLAKEMORE,ROSIE,K,FNP,F,I,TENNESSEE PRISON FOR WOMEN,3881 STEWARTS LANE,NASHVILLE,37243,0001,TN,US,Nurse Practitioner,S,N
1,1.003012e+09,CUDZILO,COREY,None,M.D.,M,I,2240 SUTHERLAND AVE,SUITE 103,KNOXVILLE,37919,2333,TN,US,Pulmonary Disease,S,E
2,1.003013e+09,GRABENSTEIN,WILLIAM,P,M.D.,M,I,1822 MEMORIAL DR,None,CLARKSVILLE,37043,4605,TN,US,Family Practice,S,E
3,1.003014e+09,OTTO,ROBERT,J,M.D.,M,I,2400 PATTERSON STREET SUITE 100,None,NASHVILLE,37203,2786,TN,US,Orthopedic Surgery,S,E
4,1.003018e+09,TODD,JOSHUA,W,M.D.,M,I,1819 W CLINCH AVE,SUITE 108,KNOXVILLE,37916,2435,TN,US,Cardiology,S,E

 1.Which Tennessee counties had a disproportionately high number of opioid prescriptions?

In [56]:
query_1 = '''With tn_prescriber As (
	Select p.npi As npi,
	fc.*,
	population.population
From prescriber as p
Left Join zip_fips as zf
On p.nppes_provider_zip5 = zf.zip
Left Join fips_county as fc
On zf.fipscounty = fc.fipscounty
Left Join population
On zf.fipscounty = population.fipscounty
Where p.nppes_provider_state Like 'TN'),
	opioid_prescriptions As(
	Select prescriber.nppes_provider_last_org_name As last_name,
		prescription.*,
		d.*
	From prescriber
	Left Join prescription
	Using (npi)
	Left Join drug as d
	Using (drug_name)
	Where prescriber.nppes_provider_state Like 'TN'
		And d.opioid_drug_flag Like 'Y'
	Order By 2)
Select tn_prescriber.county,
	Sum(opioid_prescriptions.total_claim_count) As opioid_count,
	tn_prescriber.population,
	Round(sum(opioid_prescriptions.total_claim_count)/population, 4) As opioid_ratio
From tn_prescriber
Left Join opioid_prescriptions
On tn_prescriber.npi = opioid_prescriptions.npi
Where tn_prescriber.population Is Not Null
Group By 1, 3
Order By 4 DESC;'''

In [58]:
with engine.connect() as connection:
   opioid_county = pd.read_sql(text(query_1), con = connection)

opioid_county.head()

      county  opioid_count  population  opioid_ratio
0      MOORE       44689.0      6302.0        7.0912
1    JACKSON       60726.0     11573.0        5.2472
2  VAN BUREN       23578.0      5675.0        4.1547
3  TROUSDALE       29060.0      8773.0        3.3124
4    OVERTON       63335.0     21995.0        2.8795

2.Who are the top opioid prescibers for the state of Tennessee?

In [60]:
query_2 = '''SELECT
	specialty_description,
	SUM(
		CASE WHEN opioid_drug_flag = 'Y' THEN total_claim_count
		ELSE 0
	END
	) as opioid_claims,
	SUM(total_claim_count) AS total_claims,
	SUM(
		CASE WHEN opioid_drug_flag = 'Y' THEN total_claim_count
		ELSE 0
	END
	) * 100.0 /  SUM(total_claim_count) AS opioid_percentage
FROM prescriber
INNER JOIN prescription
USING(npi)
INNER JOIN drug 
USING(drug_name)
Where prescriber.nppes_provider_state = 'TN'
GROUP BY specialty_description
ORDER BY opioid_percentage DESC
Limit 5'''

In [62]:
with engine.connect() as connection:
   opioid_prescribers = pd.read_sql(text(query_2), con = connection)

opioid_prescribers.head()

,specialty_description,opioid_claims,total_claims,opioid_percentage
0,Case Manager/Care Coordinator,36.0,50.0,72.000000
1,Orthopaedic Surgery,278.0,403.0,68.982630
2,Interventional Pain Management,34042.0,57239.0,59.473436
3,Anesthesiology,53587.0,91572.0,58.518980
4,Pain Management,42101.0,72487.0,58.080759

3.What did the trend in overdose deaths due to opioids look like in Tennessee from 2015 to 2018

In [66]:
query_3= '''Select year, 
	 Sum(overdose_deaths)
From overdose_deaths
Group by 1
Order by 2'''

In [68]:
with engine.connect() as connection:
   opioid_overdose_deaths = pd.read_sql(text(query_3), con = connection)

opioid_overdose_deaths.head()

   year   sum
0  2015  1033
1  2016  1186
2  2017  1267
3  2018  1304

For much more information about SQLAlchemy and to see a more “Pythonic” way to execute queries, see Introduction to Databases in Python: https://www.datacamp.com/courses/introduction-to-relational-databases-in-python